import java.io.Serializable;

public class Book implements Serializable
{
	private String title; //책제목
	private String author; //작가
	private String image;//이미지
	private int page; //총페이지
	private String startDate;//읽기 시작한 날짜
	private String endDate; //다 읽은 날짜
	private int rate; //평점
	private String quote;//마음에 드는 구절
	private String reflection;//감상
	
	
	//------------------------------------------------------------------------------
	//생성자 - Book 를 생성한다. 
	//------------------------------------------------------------------------------
	public Book(String title, String author, String image, int page, String startDate, String endDate, int rate, String quote, String reflection)
	{
		this.title=title;
		this.author=author;
		this.image=image;
		this.page=page;
		this.startDate=startDate;
		this.endDate=endDate;
		this.rate=rate;
		this.quote=quote;
		this.reflection=reflection;
	}
	
	//------------------------------------------------------------------------------
	//Book 정보를 반환한다.
	//------------------------------------------------------------------------------
	public String toString()
	{
		String description;
		description="<"+title+">"+"\n";
		description+="-작가: "+author+"\n";
		description+="-총페이지: "+page+"p\n";
		description+="-읽기 시작한 날짜: "+startDate+"\n";
		description+="-다 읽은 날짜: "+endDate+"\n";
		description+="-평점: "+rate+"점 \n\n";
		description+="-마음에 드는 구절:\n";
		description+=quote+"\n\n";
		description+="-감상: \n";
		description+=reflection+"\n";
		
		return description;
	}
	
	//------------------------------------------------------------------------------
	//title 을 반환한다.
	//------------------------------------------------------------------------------
	public String getTitle()
	{
		return title;
	}
	
	//------------------------------------------------------------------------------
	//author 을 반환한다.
	//------------------------------------------------------------------------------
	public String getAuthor()
	{
		return author;
	}
	
	//------------------------------------------------------------------------------
	//image 을 반환한다.
	//------------------------------------------------------------------------------
	public String getImage()
	{
		return image;
	}
	
	//------------------------------------------------------------------------------
	//page 을 반환한다.
	//------------------------------------------------------------------------------
	public int getPage()
	{
		return page;
	}
	
	//------------------------------------------------------------------------
	//startDate 을 반환한다.
	//------------------------------------------------------------------------------
	public String getStartDate()
	{
		return startDate;
	}
		
	//------------------------------------------------------------------------
	//endDate 을 반환한다.
	//------------------------------------------------------------------------------
	public String getEndDate()
	{
		return endDate;
	}
	
	
	//------------------------------------------------------------------------------
	//rate 을 반환한다.
	//------------------------------------------------------------------------------
	public int getRate()
	{
		return rate;
	}
	
	//------------------------------------------------------------------------------
	//quote 을 반환한다.
	//------------------------------------------------------------------------------
	public String getQuote()
	{
		return quote;
	}
	
	//------------------------------------------------------------------------------
	//reflection 을 반환한다.
	//------------------------------------------------------------------------------
	public String getReflection()
	{
		return reflection;
	}
		
	//------------------------------------------------------------------------------
	//title 을 변경한다.
	//------------------------------------------------------------------------------
	public void setTitle(String title)
	{
		this.title=title;
	}
	
	//------------------------------------------------------------------------------
	//title 을 변경한다.
	//-----------------------------------------------------------------------------
	public void setAuthor(String author)
	{
		this.author=author;
	}
	
	//------------------------------------------------------------------------------
	//image 을 변경한다.
	//------------------------------------------------------------------------------
	public void setImage(String image)
	{
		this.image=image;
	}
	
	//------------------------------------------------------------------------------
	//page 를 변경한다.
	//------------------------------------------------------------------------------	
	public void setPage(int page)
	{
		this.page=page;
	}
	
	//------------------------------------------------------------------------------
	//startDate 을 변경한다.
	//------------------------------------------------------------------------------	
	public void setStartDate(String startDate)
	{
		this.startDate=startDate;
	}
	
	//------------------------------------------------------------------------------
	//endDate 을 변경한다.
	//------------------------------------------------------------------------------	
	public void setEndDate(String endDate)
	{
		this.endDate=endDate;
	}
	
	//------------------------------------------------------------------------------
	//rate 을 변경한다.
	//------------------------------------------------------------------------------	
	public void setRate(int rate)
	{
		this.rate=rate;
	}
	
	//------------------------------------------------------------------------------
	//quote 을 변경한다.
	//------------------------------------------------------------------------------	
	public void setQuote(String quote)
	{
		this.quote=quote;
	}

	//------------------------------------------------------------------------------
	//reviews 을 변경한다.
	//------------------------------------------------------------------------------	
	public void setReflection(String reflection)
	{
		this.reflection=reflection;
	}	
}
